[
    {
        "name": "carousel",
        "created": "July 2021",
        "project": "Personal Portfolio",
        "desc": "The Carousel component was created to showcase my skills, however upon creating the component, I had other ideas for that section. The component is however still useful and works well, is responsive, and allows for a couple of different configuration options. \n Any valid JSX can be rendered in each Carousel Item.",
        "code": "https://github.com/luca2849/lucapassariello.co.uk/tree/main/client/src/Components/Carousel",
        "props": [
            {
                "name": "width",
                "desc": "Defines the width of the carousel component.",
                "possible_values": ["75%", "'500px'", "500", "'500'"],
                "optional": true,
                "default": "500"
            },
            {
                "name": "duration",
                "desc": "Defines the duration of the Carousel slide change animation in milliseconds.",
                "possible_values": ["300", "1000"],
                "optional": true,
                "default": "300"
            }
        ],
        "how": "The main challenge when creating the Carousel was how to hide the non-displayed slides without affecting the layout of the rest of the page. The solution found was to render all slides (items) as seperate flex items inside a relativley positioned container, with a fixed (or percentage-based) width. \n When changing slide, via the arrows or through the slide selection buttons, the distance to offset the container by is calculated using the width of the Carousel, and the entire Carousel is then transformed by that new offset, getting the user to the correct page. \n Another key feature of this Carousel is its responsiveness. I wanted the user to be able to set a variable width for the Carousel, which they can do via the width prop. This caused some issues when resizing the window, which was solved with an event listener, checking for a change in window size, and recalculating the offsets when this occurs."
    }
]